
IRAN_PROVINCE_CAPITALS = [
    "تهران",    
    "کرج",      
    "تبریز",   
    "ارومیه",  
    "اردبیل",   
    "اصفهان",   
    "ایلام",    
    "بوشهر",    
    "شهرکرد",  
    "بیرجند",  
    "مشهد",    
    "بجنورد",  
    "اهواز",    
    "زنجان",    
    "سمنان",    
    "زاهدان",  
    "شیراز",    
    "قزوین",    
    "قم",       
    "سنندج",    
    "کرمان",    
    "کرمانشاه", 
    "یاسوج",   
    "گرگان",    
    "رشت",      
    "خرم آباد",  
    "ساری",     
    "اراک",     
    "بندرعباس", 
    "همدان",    
    "یزد"       
]

VALID_DEPARTMENTS = [
    "علوم پایه",
    "فنی مهندسی",
    "ادبیات",
    "اقتصاد",
    "کشاورزی",
    "دامپزشکی"
]

VALID_ENGI_DEPARTMENT_MAJORS = [
    "مهندسی برق",
    "مهندسی مکانیک",
    "مهندسی عمران",
    "مهندسی کامپیوتر",
    "مهندسی صنایع",
    "مهندسی مواد",
    "مهندسی شیمی",
    "مهندسی نفت",
    "مهندسی معماری",
    "مهندسی شهرسازی",
    "مهندسی نقشه‌برداری"
]